---
kind: type
id: T:Autodesk.Revit.DB.AssemblyMemberDifference
source: html/f52efc08-cdbd-e169-1360-ac1dfda4220e.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifference

Class that describes difference between two assembly members

## Syntax (C#)
```csharp
public class AssemblyMemberDifference : IDisposable
```

## Remarks
Different sub-classes of this class represent different kinds of differences
 between assembly members and contain additional data for each particular kind of difference.